import React from 'react'
import { Link } from 'react-router-dom'

// Style 
import styles from '../styles/Home.module.css';

export default function Home() {
  return (
    <div className={styles.container}>
      <main>
        <h3>چند تا سوال جواب میدی ؟</h3>
        <h4>قوانین :</h4>
        <p>دو فرصت برای پاسخ گویی به سوالات دارید و بعد از پاسخ اشتباه به سوال دوم بازی به پایان می رسد و اگر به 10 سوال جواب درست دهید برنده خواهید شد.</p>
        <p>برای هر سوال 10 ثانیه فرصت دارید و اگر زمان پاسخ گویی به سوال پایان یابد به صورت خودکار به سوال بعدی انتقال داده میشوید و یک فرصت را از دست خواهید داد و اگر زود تر از زمان مشخص شده به سوال پاسخ دهید از زمان باقی مانده 3 ثانیه کم میشود و به زمان پاسخگویی سوال بعدی اضافه میشود و "لازم به ذکر است که اگر زمان باقی مانده از سوالی بیش از 15 ثانیه باشد به صورت خود کار زمان سوال بعدی 20 ثانیه در نظر گرفته میشود"</p>
        <Link to="/quizs">شروع</Link>
      </main>
    </div>
  )
}
